{"pricing":"Making a single piece of furniture will always be more per unit than a run of thousands coming out of a factory. We aim for value rather than the lowest price making all of our furniture to the highest standards. We know that bespoke furniture isn’t always the right choice for every situation but when someone does choose to invest in a piece we make sure it's something they'll cherish for years to come.\r\n\r\nEverything we make is priced individually with attention to each customers specific needs and requirements, and accordingly do not provide sample prices. Please feel free to contact us and we can give you an estimate, and then, if you wish to take things further, we will provide a design and a quote. We are happy to design and select materials to suit a variety of budgets – there are as many possibilities as there are different clients.","commissions":"The process of commissioning furniture should be a pleasure. Whatever your ideas and tastes we enjoy working with all our clients to develop a great design to suit you and your home. The first step is usually to outline the requirements, the preferred styles, materials and finish, as well as to discuss costs and your budget. Dan will then arrange to meet you in person, measure up, go through more details and options and put together a more comprehensive brief. Drawings are made and samples of materials, if required, can be provided.\r\n\r\nOnce specifications have been decided upon a quote is made and if agreed then a deposit is taken and workshop time booked. A provisional date of fitting and completion is then given, normally around 1-2 months from taking the deposit. Materials are ordered and work begins. As much work as possible is completed in the workshop, ensuring the greatest possible accuracy and quality of finishes. Your bespoke piece is then assembled and fitted on site and all finishing touches added.","ending":"For more information on the process, please be encouraged to contact Dan for an informal discussion.","about":"Cluett Carpentry is an East London based cabinetry company specialising in bespoke furniture. The company is run by Dan, the propriertor. He has worked in the trades for the past ten year in carpentry, building, tiling, plastering but now concentrates exclusively on furniture. He works with a small team of makers and artists and brings an interesting holistic view to furniture production.","number":"(+44) 7525 827 514"}