{"posts":[{"title":"Galley Kitchen","image":"1.jpg","subtitle":"Oak and Marble","text":"A modern kitchen with soft close units, integrated fridge and high spec appliances. The worktops are oak and the tiles are lemon marble."},{"title":"Rustic Bedrooom","image":"2.jpg","subtitle":"Reclaimed floor boards","text":"The doors and boxes are made with reclaimed floor boards and fitted with wrought iron cabinet furniture. This is contrasted with the clean white of the rest."},{"title":"Storage steps","image":"3.jpg","subtitle":"Oak and grey","text":"The worktop carrys the theme through, making the treads of the steps. Soft close drawers give an ergonomic storage space for all the bits and bobs."},{"title":"Drawer Fascia","image":"4.jpg","subtitle":"Cocobolo","text":"Mid way through making a set of Cocobolo drawer fronts, which are veneer cold pressed on to an mrMDF core. As a point of interest Cocobolo naturally has an  incredibly sweet smell to it."},{"title":"Folding Stool","image":"6.jpg","subtitle":"European oak","text":"Designed with a customer as part of their project to make a foldable stool to use in a meditation space. The European oak frame backs back in to the cushion bag was the bag has been deflated."},{"title":"Oak Cupboard","image":"8.jpg","subtitle":"Crown cut oak veneer","text":"A cold press veneered slab door matched with a solid oak floating shelf beneath."},{"title":"Oak Alcove Unit","image":"9.jpg","subtitle":"Cupboard and shelves dresser","text":"Fitted alcove cupboard with shelves. The doors are lipped in solid oak pre veneer so that a finger pull detail can be cut in to the wood."},{"title":"TODO","image":"10.jpg","subtitle":"TODO","text":"Replace with finished image."},{"title":"Kitchenette","image":"12.jpg","subtitle":"Matt grey with oak worktops","text":"A narrowboat side kitchen. Off shelf soft close units and drawers with a rusti oak worktop."},{"title":"Shaped worktop","image":"13.jpg","subtitle":"Rustic Oak","text":"Replacement worktops finished with a bevelled edge."},{"title":"Target Box","image":"15.jpg","subtitle":"Sray finish custom box","text":"A small mrMDF box finished in white AC spray, fitted with castors. The front opens to expose the electronic target inside and the top opens to access the mechanism."},{"title":"Vanity Unit","image":"16.jpg","subtitle":"Lemon Marble","text":"An off-shelf vanity unit fitted to a narrowboat, the splashback is lemon marble."},{"title":"Bedroom cupboards","image":"17.jpg","subtitle":"Oak and white","text":"Birch ply units with solid oak ends and shelves. The doors and fascias are finished in morning light, the ply and oak is oiled."},{"title":"Kitchen table","image":"18.jpg","subtitle":"Rustic pine","text":"Solid pine kitchen tables, with chairs and bench.  Finished in a satin varnish."},{"title":"Toy Castle","image":"19.jpg","subtitle":"Birch Ply","text":"Built to be a flat pack toy castle for a gift.  With working drawbridge."},{"title":"Shelves and cupboards","image":"20.jpg","subtitle":"Ash","text":"Solid ash adjustable shelving. Finsihed in a satin varnish."},{"title":"Solar storage box","image":"21.jpg","subtitle":"Sapele","text":"Solid sapele narrowboat roof-box.  Removable pin hinges to allow opening from either side.  "},{"title":"Storage Bed","image":"22.jpg","subtitle":"Pine","text":"Simple and rustis built in bed."},{"title":"Hallway","image":"23.jpg","subtitle":"Oak and paint","text":"Solid oak with spray finished doors and drawers. The side unit is solid oak with fluted glass doors."},{"title":"Bedside table","image":"24.jpg","subtitle":"European oak","text":"Solid oak custom table. The top is pippy oak trimmed in walnut, with a 'military box' brass handle."},{"title":"Alcove Cupboard","image":"25.jpg","subtitle":"Spray finished mrMDF","text":"Alcove storage unit with divided storage inside. Pull handle detail matched to existing cupboards."}]}